#!/bin/bash
###############################################################################
# @用例ID: 20220410-152859-724647329
# @用例名称: test_shell_testcase
# @用例级别: 3
# @用例标签:
# @用例类型: 功能
###############################################################################
[ -z "$TST_TS_TOPDIR" ] && {
    TST_TS_TOPDIR="$(realpath "$(dirname "$0")/..")"
    export TST_TS_TOPDIR
}
source "${TST_TS_TOPDIR}/lib/common.sh" || exit 1
###############################################################################

g_tmpdir="$(mktemp -d)"

tc_setup() {
    msg "this is tc_setup"
    # @预置条件:
    # @预置条件:
    return 0
}

do_test() {
    msg "this is do_test"

    # @测试步骤:1:

    # @测试步骤:2:

    # @测试步骤:3:
    # @预期结果:3:
    assert_true [ 1 -eq 1 ]

    return 0
}

tc_teardown() {
    msg "this is tc_teardown"
    rm -rfv "$g_tmpdir" || return 1
    return 0
}

###############################################################################
tst_main "$@"
###############################################################################
